{"1" : "Aggarwal, Charu C., & Reddy, Chandan K. 2013. Data Clustering: Algorithms and Applications 1st edn. Chapman & Hall/CRC",
"2" : "Arya, Vijay, Garg, Naveen, Khandekar, Rohit, Meyerson, Adam, Munagala, Kamesh, & Pandit, Vinayaka 2004. Local search heuristics for k-median and facility location problems. SIAM J. Comput., 33(3), 544–562.",
"3" : "Biddle, Dan. 2006. Adverse Impact and Test Validation: A Practitioner’G guide to Valid and De-fensible Employment Testing. Gower Publishing, Ltd.",
"4" : "Corbett-Davies, Sam, Pierson, Emma, Feller, Avi, Goel, Sharad, & Huq, Aziz. 2017. Algorithmic Decision Making and the Cost of Fairness. Pages 797–806 of: Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. KDD ’17. New York, NY, USA: ACM.",
"5" : "Dwork, Cynthia, Hardt, Moritz, Pitassi, Toniann, Reingold, Omer, & Zemel, Richard. 2012. Fairness through awareness. Pages 214–226 of: ITCS.", 
"6" : "Feldman, Michael, Friedler, Sorelle A., Moeller, John, Scheidegger, Carlos, & Venkatasubramanian, Suresh. 2015. Certifying and removing disparate impact. Pages 259–268 of: KDD.",
"7" : "Gonzalez, T. 1985. Clustering to minimize the maximum intercluster distance. TCS, 38, 293–306.",
"8" : "Hardt, Moritz, Price, Eric, & Srebro, Nati. 2016. Equality of opportunity in supervised learning. Pages 3315–3323 of: NIPS.",
"9" : "Joseph, Matthew, Kearns, Michael, Morgenstern, Jamie H., & Roth, Aaron. 2016. Fairness in learning: Classic and contextual bandits. Pages 325–333 of: NIPS.",
"10" : "Kamishima, Toshihiro, Akaho, Shotaro, Asoh, Hideki, & Sakuma, Jun. 2012. Fairness-aware classifier with prejudice remover regularizer. Pages 35–50 of: ECML/PKDD.",
"11" : "Kanungo, Tapas, Mount, David M., Netanyahu, Nathan S., Piatko, Christine D., Silverman, Ruth, & Wu, Angela Y. 2002. An efficient k-means clustering algorithm: Analysis and implementation. PAMI, 24(7), 881–892.",
"12" : "Kleinberg, Jon, Lakkaraju, Himabindu, Leskovec, Jure, Ludwig, Jens, & Mullainathan, Sendhil. 2017a. Human decisions and machine predictions. Working Paper 23180. NBER.",
"13" : "Kleinberg, Jon M., Mullainathan, Sendhil, & Raghavan, Manish. 2017b. Inherent trade-offs in the fair determination of risk scores. In: ITCS.",
"14" : "Kohavi, Ron. 1996. Scaling up the accuracy of naive-Bayes classifiers: A decision-tree hybrid. Pages 202–207 of: KDD.",
"15" : "Li, Shi, & Svensson, Ola. 2013. Approximating k-median via pseudo-approximation. Pages 901–910 of: STOC.",
"16" : "Lichman, M. 2013. UCI Machine Learning Repositor. Luong, Binh Thanh, Ruggieri, Salvatore, & Turini, Franco. 2011. k-NN as an implementation of situation testing for discrimination discovery and prevention. Pages 502–510 of: KDD.",
"17" : "Moro, Sérgio, Cortez, Paulo, & Rita, Paulo. 2014. A data-driven approach to predict the success of bank telemarketing. Decision Support Systems, 62, 22–31.",
"18" : "Xu, Rui, & Wunsch, Don. 2009. Clustering. Wiley-IEEE Press.",
"19" : "Zafar, Muhammad Bilal, Valera, Isabel, Gomez-Rodriguez, Manuel, & Gummadi, Krishna P. 2017. Fairness constraints: Mechanisms for fair classification. Pages 259–268 of: AISTATS.",
"20" : "Zemel, Richard S., Wu, Yu, Swersky, Kevin, Pitassi, Toniann, & Dwork, Cynthia. 2013. Learning fair representations. Pages 325–333 of: ICML."}
